{
	"_meta": {
		"sources": [
			{
				"json": "Revised-Martial-Equipment",
				"abbreviation": "RME",
				"full": "Revised Martial Equipment"
			}
		]
	},
	"itemProperty": [
		{
			"abbreviation": "AW",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Awkward",
					"entries": [
						"This weapon requires additional training to use properly, but you still get limited use with it. You do not add your proficiency bonus while rolling an attack with this weapon."
					]
				}
			]
		},
		{
			"abbreviation": "CCL",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Conceal",
					"entries": [
						"You gain advantage on Sleight of Hand Checks made to conceal the weapon on your person. If it is discovered, some conceal weapons still require the searching party makes a successful Intelligence check to identify what it is. "
					]
				}
			]
		},
		{
			"abbreviation": "BR",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Brace",
					"entries": [
						"As an Action you choose to Brace. On your turn, choose any targets you can see that are at least 20 feet away from you. If any one of those targets move within your weapon’s reach before your next turn, you can make one melee attack against it with your weapon, which uses your reaction. If the attack hits, treat the attack as a critical hit. While bracing, you cannot use a different reaction. While bracing, if you move or are moved against your will, you forfeit the reaction until your next turn. A brace attack is not an Opportunity Attack. "
					]
				}
			]
		},
		{
			"abbreviation": "DEF",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Deflect",
					"entries": [
						"If struck by a melee weapon attack, you can use your reaction to roll your weapon’s damage plus your strength modifier, then subtract that total from the damage dealt to you for one attack. If you are dual wielding deflect weapons, you gain an additional reaction which may only be used to deflect."
					]
				}
			]
		},
		{
			"abbreviation": "DIS",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Disarm",
					"entries": [
						"You may only make a disarm attempt with weapons that have the Disarm property, unless you have an ability that says otherwise. On hit, you can choose to only deal damage equal to your Strength modifier, minimum of 1, and force your enemy to roll a Strength or Dexterity Saving Throw. On a failure, it drops one held object of your choice, landing within 5ft of it. If the enemy is larger than you or is using a two-handed weapon, it gains advantage on this save. If it is smaller than you, it suffers disadvantage. Shields that are strapped to the arm are immune to Disarm. If you land a critical hit with this attack, you deal your weapon's damage in addition to forcing your enemy to roll the saving throw."
					]
				}
			]
		},
		{
			"abbreviation": "DBL",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Double Ended",
					"entries": [
						"You make one additional attack as a bonus action (or part of the attack action, see: Best Practices) using the damage listed, if you are within 5 ft of your target and wielding your weapon with two hands. Double Ended attacks do not benefit from any other weapon property, nor can they make special attacks such as Disarm, Entangle, or Trip. A Double Ended attack is strictly damage."
					]
				}
			]
		},
		{
			"abbreviation": "ENT",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Entangle",
					"entries": [
						"On hit, you can choose to deal only your Strength modifier in damage, minimum of 1, and force the enemy to succeed on a Strength or Dexterity Saving Throw or be grappled. To escape, the entangled target must succeed a grapple check against your weapon DC, gaining advantage if it is larger than you. Creatures two size categories larger than you are immune to being entangled. If you land a critical hit with this attack, you deal your weapon's damage in addition to forcing your enemy to roll the saving throw. While you are holding the weapon entangling your target, your attacks only damage equal to your Strength modifier. You may also interact with your target as if you were grappling it, for example, moving it or shoving it. You can release a foe from being entangled at any time. If you drop the weapon, the foe is automatically freed. "
					]
				}
			]
		},
		{
			"abbreviation": "FIR",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Firearm",
					"entries": [
						"Rolling a 1 on an Attack Roll causes this weapon to jam. It's still loaded, but a malfunction prevented ignition. As an action, you must clear the jam before it can make a ranged attack again. Firearm weapons can't make ranged attacks underwater, and if they are subjected to water such as from rain or a tidal wave spell, they jam on a 1-2 until you spend an action to dry them. All firearms create a sound which can be heard up to 300ft away. Firearm weapons that have the Ranged property require gun powder and either lead ball, bullet, or shot loaded into it to make an attack. Ammunition is not recoverable from Firearm weapons. Firearm weapons that have the Launch property can be recovered if they fail to go off due to a jam (meaning the weapon was thrown, but did not explode when it landed)."
					]
				}
			]
		},
		{
			"abbreviation": "LNC",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Launch",
					"entries": [
						"If you miss, this weapon lands on the ground but still goes off within 5ft of the intended target. Roll a d8. The result is which square it lands in, starting with the square closest to you as 1, and counting clockwise until you reach the rolled number."
					]
				}
			]
		},
		{
			"abbreviation": "LUN",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Lunge",
					"entries": [
						"If you use an attack action, you can use your reaction to attack a foe up to 5ft further than normal with all attacks for that turn, which can be combined with Reach. This ends with your turn and cannot be used as part of an Opportunity Attack."
					]
				}
			]
		},
		{
			"abbreviation": "PEN",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Penetrate",
					"entries": [
						"These weapons are designed to penetrate armor and deal more damage to those wearing it. While attacking an enemy using a shield or wearing heavy armor, you can roll total damage from your weapon twice and take the better result. "
					]
				}
			]
		},
		{
			"abbreviation": "TRP",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Trip",
					"entries": [
						"If your attack is successful, you can choose to deal only your Strength modifier in damage, minimum of 1, and your enemy must succeed on a Strength or Dexterity Saving Throw or be knocked prone. If you land a critical hit, you deal your weapons damage in addition to forcing your enemy to roll the saving throw. Enemies a size category larger than you gain advantage on this save. Enemies two size categories larger than you are immune to being tripped in this way. "
					]
				}
			]
		}
	],
	"item": [
		{
			"name": "Punch Dagger",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 1,
			"weight": 1,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "P/S",
			"property": [
				"CCL",
				"F",
				"L",
				"PEN"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"You have advantage on opportunity attacks made with this weapon. Additionally, if this weapon is in your off hand, you may make an opportunity attack with your main hand and this weapon."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Whip Dagger",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 15,
			"weight": 3,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"CCL",
				"ENT",
				"F",
				"R",
				"2H"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Allows you to wield the weapon with one hand, and gives the Lunge property. When your attack is successful, as a Bonus Action, you can choose to force the enemy to succeed on a Strength saving throw or be pulled up to 10ft toward you."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Gauntlet",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 10,
			"weight": 1,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "B/P/S",
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery gives the light property, and the damage scales with proficiency, d4, d6, d8, and d10 for +2, +3, +5, and +6 respectively. As a reaction to a melee attack, before the roll, you can declare that you try to catch the attack. If the attack misses, you have advantage on your next weapon attack, athletics, or acrobatics check against that enemy, or you can give disadvantage to these checks your enemy makes on their next turn, unless they let go of their weapon."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"Putting on or taking off gauntlets is an action, and they cannot be disarmed."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Hidden Blade",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 50,
			"weight": 1,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"CCL",
				"F",
				"L"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Any hit against a surprised creature takes maximum damage from this weapon and any modifiers such as sneak attack, instead of rolling for the damage."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"The hand this weapon is equipped to is open, allowing it to wield a weapon, shield, grapple, or perform somatic components for a spell. However, you can’t deploy a hidden blade into a hand that is holding something else. This weapon cannot be disarmed but takes an action to equip or remove."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Interceptor",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 3,
			"weight": 1,
			"dmg1": "0",
			"dmg2": "",
			"dmgType": "",
			"property": [
				"CCL",
				"DEF",
				"F",
				"L"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery gains the Disarm, Entangle, and Trip properties. The deflect die is 1d8. You may use the Deflect property against flight weapons. When a creature you can see attacks a target that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"Wielding an Interceptor gives you +1 AC."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Knuckle Axe",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 25,
			"weight": 1,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "S",
			"property": [
				"DEF",
				"L"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"When you score a critical hit, make an additional melee attack to another creature adjacent to you as part of the same action."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Side Baton",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 10,
			"weight": 2,
			"dmg1": "1d6",
			"dmg2": "1d8",
			"dmgType": "B",
			"property": [
				"DEF",
				"L"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Trip property, and 1d8 damage. Your deflect roll is 2d10, rather than d8, and you may add your proficiency to this roll."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Unarmed Strike",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 0,
			"weight": 0,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "B",
			"property": [
				"F"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery gives the Deflect, Disarm, Light, and Trip properties, and the damage scales with proficiency, d4, d6, d8, and d10 for +2, +3, +5, and +6 respectively. You may use your bonus action to perform a shove or disarm attack."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"Unarmed strikes do not count as weapon attacks until you have mastery training with them."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Battle Axe",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 10,
			"weight": 4,
			"dmg1": "1d8",
			"dmg2": "1d10",
			"dmgType": "S",
			"property": [
				"TRP",
				"V"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery makes the damage 1d10 or 1d12 two handed. Reroll a damage dice result of 1 or 2 for both damage dice and any attachers, such as smite."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"Versatile damage is 1d10."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Greataxe",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 30,
			"weight": 6,
			"dmg1": "1d12",
			"dmg2": "2d8",
			"dmgType": "S",
			"property": [
				"2H",
				"DIS",
				"H",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery makes damage 2d8. When you roll at least 5 higher than the enemy's AC, you can roll all damage and any attachers twice and take the better result."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Halberd",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 35,
			"weight": 7,
			"dmg1": "2d6",
			"dmg2": "3d4",
			"dmgType": "P/S",
			"property": [
				"2H",
				"BR",
				"H",
				"R",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery gives the Entangle property, and makes the damage 3d4. You gain advantage on trip attacks made to mounted enemies and Large creatures. If your trip is successful against a mounted foe, it is automatically pulled from its mount to a prone position. You gain advantage on entangle attacks made against enemies two size categories larger than you."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"With martial proficiency, a halberd can be used to perform a trip against mounted foes to pull them from the saddle and to a prone position. Mastery grants advantage on this maneuver."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Handaxe",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 5,
			"weight": 2,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "S",
			"property": [
				"T",
				"L",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery gives the Disarm property. You gain advantage on all disarm attacks."
					]
				}
			],
			"range": "20/60",
			"source": "RME"
		},
		{
			"name": "Hook Sword",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 60,
			"weight": 2,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "S",
			"property": [
				"DEF",
				"DIS",
				"F",
				"L",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery gives the Entangle and Lunge properties. When you are hit with a melee weapon attack, as a reaction you can make a disarm or entangle attack against that enemy. While dual wielding two hook swords, you have reach and a lunge does not use your reaction."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Kopesh",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 10,
			"weight": 3,
			"dmg1": "2d4",
			"dmg2": "",
			"dmgType": "S/P",
			"property": [
				"DIS",
				"TRP",
				"L"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"When you make a trip attack, if you hit, even if they save against the attempt your enemy's speed is reduced by 10ft until the end of their next turn. While they have this penalty, they have disadvantage saving throws against a trip attack."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Poleaxe",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 40,
			"weight": 7,
			"dmg1": "1d10",
			"dmg2": "2d6",
			"dmgType": "B/P/S",
			"property": [
				"BR",
				"DEF",
				"H",
				"PEN",
				"TRP",
				"2H"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases damage to 2d6. While wielding a poleaxe, you gain +1 AC and you may add your proficiency bonus to deflect rolls."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Tomahawk",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 1,
			"weight": 1,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "S/P",
			"property": [
				"T",
				"F",
				"L",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery gives the Disarm property. You can choose to take a -5 penalty to a ranged attack roll. If the attack hits, you add +10 to the attack's damage."
					]
				}
			],
			"range": "40/120",
			"source": "RME"
		},
		{
			"name": "Greatclub",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 0.2,
			"weight": 8,
			"dmg1": "1d8",
			"dmg2": "",
			"dmgType": "B",
			"property": [
				"DIS",
				"PEN",
				"H",
				"2H"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Deflect property, and increases the damage to 1d10. If you are successful in a disarm attempt, the enemy can no longer add proficiency to attacks with that weapon."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Heavy Club",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 0.1,
			"weight": 3,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "B",
			"property": [
				"T"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the versatile property, and increases the damage to 1d8 and the two handed damage to 1d10. The thrown range increases to 20 and 40. When you score a critical hit, your enemy is stunned for d4 rounds. At the end of each of its turns, your stunned enemy can attempt a Constitution saving throw, ending the effect on a success."
					]
				}
			],
			"range": "10/30",
			"source": "RME"
		},
		{
			"name": "Light Club",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 0.1,
			"weight": 2,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "B",
			"property": [
				"CCL",
				"T",
				"F",
				"L"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases damage to 1d6. On hit, you can choose to deal only your Strength modifier in damage but your foe must succeed on a Constitution saving throw or suffer disadvantage to its Saving Throws until the end of your next turn."
					]
				}
			],
			"range": "20/60",
			"source": "RME"
		},
		{
			"name": "Bar Mace",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 3,
			"weight": 3,
			"dmg1": "1d8",
			"dmg2": "",
			"dmgType": "B/P",
			"property": [
				"DIS"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Deflect property. If you successfully Disarm, your enemy has disadvantage on melee attacks. At the end of its turn, it can attempt a Constitution saving throw, ending this effect on a success. You can apply this effect to any creature on success regardless of if it is wielding a weapon."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Flanged Mace",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 5,
			"weight": 4,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "B/S",
			"property": [
				"PEN",
				"L"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases the damage to 1d8. Your penetrate affects creatures in any armor. You may also add your strength modifier twice to Penetrate damage totals."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Mallet",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 0.3,
			"weight": 3,
			"dmg1": "1d8",
			"dmg2": "",
			"dmgType": "B",
			"property": [
				"T",
				"DIS",
				"L"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases the range to 30 and 90. As a bonus action, you can make a shove attempt that, if successful, deals bludgeoning damage equal to your strength modifier."
					]
				}
			],
			"range": "20/60",
			"source": "RME"
		},
		{
			"name": "Morningstar",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 15,
			"weight": 6,
			"dmg1": "1d10",
			"dmg2": "",
			"dmgType": "B/P",
			"property": [
				"2H",
				"BR",
				"PEN",
				"R"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery gives the Double Ended property, with the damage being 1d4, and increases the main weapon damage to 1d12. As an action, you can try to ruin the protective qualities of your enemy's armor, even if it is Natural Armor. You can use an action to make an attack, taking -5 to the roll. On hit, you deal piercing damage equal to your strength modifier, but reduce the enemy's AC by the same amount."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Quarterstaff",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 0.5,
			"weight": 3,
			"dmg1": "1d8",
			"dmg2": "1d6",
			"dmgType": "B",
			"property": [
				"2H",
				"DBL"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases the Double Ended damage to 1d8. You gain +1 AC while wielding this weapon. Additionally, you may use Double Ended when making an Opportunity Attack, making two attacks instead of one."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"Double Ended damage is 1d6."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Bladed Bow",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 100,
			"weight": 5,
			"dmg1": "1d8",
			"dmg2": "1d6",
			"dmgType": "P/S",
			"property": [
				"2H",
				"F",
				"H"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery gives the Double Ended property, for 1d6 damage. As a bonus action, you may choose the disengage action."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"Melee damage is 1d6, ranged damage is 1d8."
					]
				}
			],
			"range": "120/600",
			"source": "RME"
		},
		{
			"name": "Compound Bow",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 500,
			"weight": 3,
			"dmg1": "1d10",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"2H",
				"LD",
				"PEN"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery makes the damage 1d12. When you overdraw, you take the normal -5 to attack, but if you hit, you deal damage to your primary target, and one other target in a straight line from you that intercects your first target."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"Reload at martial training is as an Object Interation. At martial trainng, it is as part of an attack."
					]
				}
			],
			"range": "200/800",
			"source": "RME"
		},
		{
			"name": "Greatbow",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 75,
			"weight": 5,
			"dmg1": "1d10",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"2H",
				"H",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases damage to 1d12. When you score a critical hit, your enemy must succeed on a strength saving throw or be shoved 5ft in a straight line away from you and knocked prone. Large creatures have advantage on this save, and larger creatures are immune. Creatures that are flying have disadvantage on this save."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"At least STR 13 is required to wield this bow. Additionally, javelins and ballista bolts can be used as ammunition, but with disadvantage on the attack."
					]
				}
			],
			"range": "200/800",
			"source": "RME"
		},
		{
			"name": "Longbow",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 50,
			"weight": 2,
			"dmg1": "1d8",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"2H",
				"H"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases damage to 1d10. If you suffer disadvantage for any reason, you can use your reaction to attempt a concentration check against DC10 or half your target's AC, whichever is higher. If you succeed, your disadvantage is negated."
					]
				}
			],
			"range": "120/600",
			"source": "RME"
		},
		{
			"name": "Recurve",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 150,
			"weight": 2,
			"dmg1": "2d4",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"2H"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"You can loose two arrows at the same time. You must choose two targets within your normal range that are within 5 ft of one another, but may attack each target separately with the same attack. These attacks suffer disadvantage that cannot be removed."
					]
				}
			],
			"range": "120/600",
			"source": "RME"
		},
		{
			"name": "Shortbow",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 25,
			"weight": 2,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"2H"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases damage to 1d8. You threaten 5ft around you and can make a ranged opportunity attack when an enemy leaves your threatened space. You do not have disadvantage to ranged attacks if an enemy is within 5ft of you."
					]
				}
			],
			"range": "80/320",
			"source": "RME"
		},
		{
			"name": "Sling",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 0.1,
			"weight": 0,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "B",
			"property": [
				"CCL",
				"DIS"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases damage to 1d6, and gives the Entangle, Light, and Trip properties. Additionally it allows you to make melee attacks, with 1d6 damage. You can take -5 to the attack roll to hurl with extra strength, and on hit, the target must succeed on a Constitution saving throw or have disadvantage to attacks until the end of its next turn."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"Can use rounded stones or small bits of anything that can fit in the leather cup, though these attacks are made with -1 to the attack roll."
					]
				}
			],
			"range": "30/120",
			"source": "RME"
		},
		{
			"name": "Wrist Shot",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 5,
			"weight": 1,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "B/S",
			"property": [
				"2H",
				"DIS"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"You can measure distance from yourself to a single DM approved obstacle, and then to your target. If that range is within your long distance, you can ignore any cover the enemy has. You can bounce twice, but this attack is made with disadvantage."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"Can use debris or rounded stones as ammunitions, with a -1 to the attack roll."
					]
				}
			],
			"range": "40/160",
			"source": "RME"
		},
		{
			"name": "Dagger",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 2,
			"weight": 1,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "P/S",
			"property": [
				"T",
				"CCL",
				"F",
				"L"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"You can use a bonus action to make an attack with a dagger, even if you don't take the attack action."
					]
				}
			],
			"range": "20/60",
			"source": "RME"
		},
		{
			"name": "Kukri",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 3,
			"weight": 2,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "S",
			"property": [
				"L",
				"T",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery adds the Disarm property, and increases the range to 40/120. Reroll any damage die from this weapon or any attachers that rolls a 1. Additionally, when you trip, your target's speed is reduced by 10ft until the end of their next turn."
					]
				}
			],
			"range": "40/80",
			"source": "RME"
		},
		{
			"name": "Rapier",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 25,
			"weight": 2,
			"dmg1": "1d8",
			"dmg2": "",
			"dmgType": "P/S",
			"property": [
				"F",
				"L"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery gives the Deflect and Lunge properties. If you are wielding a rapier and nothing in your off hand, you can add d4 to your damage roll. If you are wielding a light weapon, instead add +1 to AC."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Saber",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 35,
			"weight": 2,
			"dmg1": "1d8",
			"dmg2": "",
			"dmgType": "P/S",
			"property": [
				"F",
				"DEF"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Melee damage increased to 2d4, and adds the Light property. If an enemy hits you with a melee weapon attack, you can use your reaction to add your proficiency to your AC, possibly negating a successful hit. This added bonus to AC lasts for that enemy's turn only."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Sai",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 5,
			"weight": 1,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"CCL",
				"DEF",
				"F",
				"L"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Disarm property. You gain +1 AC if you are wielding a Sai in your off hand, and you may perform a Disarm attack as a reaction if an enemy misses you with a melee attack."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Shortsword",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 10,
			"weight": 2,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "P/S",
			"property": [
				"F",
				"L"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery makes the damage 1d8. When you have advantage on the attack, you can roll damage twice and take the better result, including any attachers, such as elemental imbue damage or sneak attacks."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Sickle",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 1,
			"weight": 2,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "P/S",
			"property": [
				"L",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery makes the damage 1d6, and grants the Entangle property. Your entangle attacks deal full weapon damage on hit. When you hit with a trip attack, your enemy suffers -10 ft to its speed until the end of its next turn, regardless of if it succeeds on the save against the trip."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Smallsword",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 30,
			"weight": 1,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"F",
				"L",
				"PEN"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Lunge property. If you have advantage on your attack, you may add d4 to your attack roll. If you have disadvantage on your attack, you may spend your bonus action to roll your choice of athletics or acrobatics to negate the disadvantage. The DC is equal to your targets AC."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Arquebus",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 750,
			"weight": 10,
			"dmg1": "2d10+5",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"2H",
				"H",
				"FIR",
				"PEN",
				"LD"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"As a Bonus Action, you affix a bayonet to the arquebus, giving you a pike at Master training, including its Master Perk, but disadvantage on ranged attacks."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"Must expend an attack to reload. Can deploy a bipod as a bonus action to negate the disadvantage for attacking beyond its normal range."
					]
				}
			],
			"range": "300/900",
			"source": "RME"
		},
		{
			"name": "Blunderbuss",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 300,
			"weight": 5,
			"dmg1": "2d8+5",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"2H",
				"FIR",
				"LD",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases damage to 2d10+5. If a target is within 15ft, it must succeed on a Strength saving throw or be pushed back 5ft or knocked prone."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"Must expend an attack to reload. Doesn't suffer disadvantage against targets within 5 ft, and instead gains the Penetrate quality. When attacking, you choose a target and up to two targets within 5 ft of it. One shot makes an attack against all three. Blunderbuss does not have a long range."
					]
				}
			],
			"range": "60",
			"source": "RME"
		},
		{
			"name": "Firelance",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 200,
			"weight": 5,
			"dmg1": "1d10",
			"dmg2": "1d12",
			"dmgType": "F",
			"dmgType2": "P"
			"property": [
				"2H",
				"FIR",
				"LD"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"While loaded, as an action, you sweep fire around you, forcing all targets within 10ft to succeed on a Dexterity saving throw or suffer 2d4 fire damage."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"Ranged fire attack spread out in a 15 ft cone from within 10 ft of you, targets within the cone must make a DEX save or take the fire damage plus your DEX bonus. Can also be used as a lance in melee, dealing 1d12 damage. Reloads as a bonus action."
					]
				}
			],
			"range": "15",
			"source": "RME"
		},
		{
			"name": "Hand Cannon",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 250,
			"weight": 3,
			"dmg1": "1d10+5",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"FIR",
				"PEN",
				"LD"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery makes the damage 1d12+5. You can make a ranged attack as a bonus action, even if you didn't take the attack action."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"This weapon doesn't suffer disadvantage when an enemy is within 5 ft. Must expend an attack to reload."
					]
				}
			],
			"range": "200/600",
			"source": "RME"
		},
		{
			"name": "Pepperbox",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 1500,
			"weight": 1,
			"dmg1": "2d4+5",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"CCL",
				"L",
				"FIR",
				"LD"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery makes the damage 2d6. As an action, you fire all barrels at once, rolling an attack for each loaded barrel against an enemy 10ft or less from you. After two shots, the weapon jams on 2-3, and is destroyed if you roll a 1."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"This weapon doesn't suffer disadvantage when an enemy is within 5 ft. The weapon can be fired four times before reloading. Reloading requires an action, which will only reload 2 barrels. Variants with more barrels can be purchased, with a 5 barrel and 6 barrel option for 2000 and 2500 respectively."
					]
				}
			],
			"range": "30/120",
			"source": "RME"
		},
		{
			"name": "Firepot",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 25,
			"weight": 2,
			"dmg1": "2d6",
			"dmg2": "",
			"dmgType": "F",
			"property": [
				"FIR",
				"T",
				"LNC"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Light property. Your can attack two targets if they are within 5ft of each other."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"After being hit, the target continues to take 1d6 fire damage at the start of its turn for 1d6 rounds. They can use an action to make a dexterity saving throw as an action, extinguishing it on a success. Alternatively, an ally can make an acrobatics check to attempt to pat them out. On a miss, the fire burns for 1d6 rounds, and any creature starting its turn there or entering the space for the first time on its turn must make a DEX save, or suffer 1d6 fire damage."
					]
				}
			],
			"range": "20/80",
			"source": "RME"
		},
		{
			"name": "Flash Bomb",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 35,
			"weight": 2,
			"dmg1": "1d8",
			"dmg2": "",
			"dmgType": "R",
			"property": [
				"T",
				"FIR",
				"LNC"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Light property. You don't suffer disadvantage with an enemy within 5ft of you. You can choose to deal no damage, but give your target disadvantage on the save."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"When hit, target must succeed on a dexterity saving throw or become blinded until the end of your next turn. Targets with sunlight sensitivity make this roll with disadvantage. Upon a miss, any creature in the square the flash bomb lands in takes no damage and has advantage on the dexterity save."
					]
				}
			],
			"range": "20/80",
			"source": "RME"
		},
		{
			"name": "Powder Charge",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 150,
			"weight": 2,
			"dmg1": "3d6",
			"dmg2": "",
			"dmgType": "P/T",
			"property": [
				"T",
				"LNC",
				"PEN"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Light property. You can choose to deal only d6 damage, but force all affected targets to succeed on a Strength saving throw or fall prone."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Ability",
					"entries": [
						"All targets within 10 ft of the of the target must succeed of a dexterity saving throw or take 2d6 piercing damage and 1d6 thunder damage. The sound it creates can be heard up to 600 ft away."
					]
				}
			],
			"range": "20/80",
			"source": "RME"
		},
		{
			"name": "Bastard Sword",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 40,
			"weight": 4,
			"dmg1": "1d12",
			"dmg2": "",
			"dmgType": "P/S",
			"property": [
				"2H",
				"H"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery gives it the Versatile property, making one handed damage 1d12 and two handed damage 2d6. Your Critical hit range is 19-20, unless it is 18-20. Against category size Large and larger enemies, your damage is 2d8(2d10) instead of d12(2d6)."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Broadsword",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 20,
			"weight": 3,
			"dmg1": "2d4",
			"dmg2": "",
			"dmgType": "P/S",
			"property": [
				"PEN"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases the damage to 3d4. When you score a critical hit, triple your Strength modifier to damage, and make one additional attack as part of the same action. This effect can only happen once during your turn."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Greatsword",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 50,
			"weight": 5,
			"dmg1": "2d8",
			"dmg2": "",
			"dmgType": "P/S",
			"property": [
				"2H",
				"H"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases the damage to 2d10. Against category size Large and larger enemies, your damage is 2d12, instead of 2d10."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Katana",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 10,
			"weight": 2,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "P/S",
			"property": [
				"F",
				"V"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases the damage to 1d8/1d10, and grants the Deflect and Light properties. While wielding this weapon with two hands, your deflect dice becomes 2d10. With one hand, you may add your proficiency bonus to your deflect rolls."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"Versatile damage is 1d8."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Longsword",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 15,
			"weight": 3,
			"dmg1": "1d8",
			"dmg2": "",
			"dmgType": "P/S",
			"property": [
				"DIS",
				"V"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases the damage to 1d10/1d12, and grants the Finesse property. Your Critical hit range is 18-20."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"Versatile damage is 1d10."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Montante",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 75,
			"weight": 5,
			"dmg1": "2d6",
			"dmg2": "",
			"dmgType": "P/S",
			"property": [
				"2H",
				"H",
				"R"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases the damage to 3d6. You have +1 AC while wielding this weapon, and you negate any flanking bonus any enemy might have for flanking you or having the enemy's ally near you, such as pack tactics or sneak attack."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Scimitar",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 25,
			"weight": 2.5,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "S",
			"property": [
				"F",
				"L"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases damage to 1d8, and grants the Deflect property. When you choose to deflect, you may roll twice and take the better result. Additionally, if you travel at least 20ft before you make an attack, your weapon deals an additional 2d8 slashing damage."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Short Glaive",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 45,
			"weight": 4,
			"dmg1": "2d4",
			"dmg2": "",
			"dmgType": "P/S",
			"property": [
				"2H",
				"F",
				"LUN"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Brace property. If an enemy misses you with a melee attack, you can use your reaction to make a melee attack against that enemy."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Blowgun",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 1,
			"weight": 1,
			"dmg1": "1d2",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"LD"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Damage increases to 1d4. You can load two darts. Roll two attacks against the same target. Each dart deals d2 damage and applies their effect to the target, but you can only do this at your normal range."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"Reloading time is as part of the attack. Attacking from stealth and missing does not reveal your location. Can be shot with one hand, but requires two to reload."
					]
				}
			],
			"range": "25/100",
			"source": "RME"
		},
		{
			"name": "Hand Crossbow",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 75,
			"weight": 2,
			"dmg1": "1d6+1",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"L",
				"LD"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery makes the reload be part of the attack. Can be reloaded with one hand. As a bonus action, you can make an attack with this weapon, even if you haven't taken the attack action."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"Reloading time is a Free Object Interaction."
					]
				}
			],
			"range": "30/120",
			"source": "RME"
		},
		{
			"name": "Heavy Crossbow",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 50,
			"weight": 8,
			"dmg1": "1d10+3",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"2H",
				"H",
				"LD",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery makes reloading a bonus action. Before you roll an attack, you can choose to take -5 to the roll. If you hit, your enemy must succeed on a strength saving throw or be knocked prone. Category Large creatures gain advantage on this save, while larger creatures are immune. Flying creatures suffer disadvantage on this save while flying."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"Reloading time takes the place of an attack."
					]
				}
			],
			"range": "100/400",
			"source": "RME"
		},
		{
			"name": "Hidden Crossbow",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 150,
			"weight": 1,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"CCL",
				"L",
				"LD"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases the range to 30/60, and makes the reload time a reaction. If an enemy misses you with an attack, you can use your reaction to make a ranged attack against it."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"Reloading time is a bonus action. The hand this weapon is equipped to is open, however, you can’t deploy a hidden crossbow from a hand that is holding something. This weapon cannot be disarmed, but takes 1 action to equip or remove."
					]
				}
			],
			"range": "20/40",
			"source": "RME"
		},
		{
			"name": "Light Crossbow",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 50,
			"weight": 5,
			"dmg1": "1d8+2",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"2H",
				"LD"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Reloading time is reduced to a free object interaction. You threaten 5ft around you and can make a ranged opportunity attack if an enemy leaves your threatened space."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"Reloading time is a reaction. An alternative to the light crossbow is the repeating crossbow, which can hold 6 bolts. As long as it holds bolts, reloading is part of the attack action. Loading a new case of 6 bolts takes an action, which provokes attacks of opportunity. Only light crossbows can be made repeating."
					]
				}
			],
			"range": "80/320",
			"source": "RME"
		},
		{
			"name": "Mauler",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 100,
			"weight": 6,
			"dmg1": "3d4",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"2H",
				"LD"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Master increases the range to 40/80, and makes the reload a bonus action. When you score a critical within 30ft, roll 6d4 for your bonus critical damage."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"Reloading time is in place of an attack. Attacking in the far range on medium or smaller targets only deals 1d4 damage, as only the top bolt is accurate at range. Large an larger size targets take the full damage."
					]
				}
			],
			"range": "30/60",
			"source": "RME"
		},
		{
			"name": "Portable Ballista",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 1500,
			"weight": 15,
			"dmg1": "1d12+4",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"2H",
				"H",
				"PEN",
				"LD",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Master makes the reload a bonus action. The crossbow mastery feat's two-target range is 50ft. If you choose a piece of terrain within 5ft of your target and which flanks your target with you, you can instead give the restrained condition to your target on that terrain. Escape DC is your weapon DC."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"Reloading time is in place of an attack. A deployable stand can be purchased to mount the weapon. As an action, the weapon is mounted to the stand and can be reloaded as an object interaction."
					]
				}
			],
			"range": "150/600",
			"source": "RME"
		},
		{
			"name": "Spinner",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 100,
			"weight": 2,
			"dmg1": "2d4",
			"dmg2": "",
			"dmgType": "S",
			"property": [
				"S"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Light property. On a critical hit, the blade bounces off its target and hits another target of your choice within 10ft of the first target, dealing normal weapon damage."
					]
				},
				{
					"type": "entries",
					"name": "Special",
					"entries": [
						"This gnomish invention launches discus blades with internal mechanisms instead of tension limbs. It holds 20 blades and reloading is part of the attack, though when depleted, it takes an Action to reload with 20 more. Range can be measured to an obstacle, then your target. If it is less than normal range, ignore any cover the creature has."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Double Flail",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 20,
			"weight": 7,
			"dmg1": "2d4",
			"dmg2": "",
			"dmgType": "B/P",
			"property": [
				"H",
				"V"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery damage increases to 2d6/2d8, and the weapon gains the trip property. When you suffer disadvantage but one dice would have hit, you deal 1 of the weapon's damage dice plus your strength modfier, even though this still counts as a miss. If you have advantage and both dice hit, add your Strength modifier twice to the damage total."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"Versatile damage is 2d6."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Light Flail",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 8,
			"weight": 3,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "B/P",
			"property": [
				"DIS",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Light property. If you miss with an attack, you may use your reaction to make one extra attack as part of the same action."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Heavy Flail",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 10,
			"weight": 5,
			"dmg1": "1d8",
			"dmg2": "",
			"dmgType": "B/P",
			"property": [
				"H",
				"PEN",
				"V",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Damage increases to 1d10/1d12, and the weapon gains the Disarm property. If your enemy succeeds on their save against your disarm, entangle, or trip attack, you can make an attack as part of the same action."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"Versatile damage is 1d10."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Pole Flail",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 25,
			"weight": 10,
			"dmg1": "1d10",
			"dmg2": "",
			"dmgType": "B",
			"property": [
				"2H",
				"H",
				"R",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Entangle property. When you hit with an opportunity attack, that creature's speed is halved until the end of its next turn."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Meteor Hammer",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 5,
			"weight": 3,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "B",
			"property": [
				"2H",
				"ENT",
				"LUN",
				"R",
				"F"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Disarm and Trip properties. As an action, you begin twirling the hammer around you in a 10ft radius. Until the start of your next turn, any creature of your choice which starts its turn or which enters this space must succeed on a Dexterity save or be damaged as if you hit it with a melee attack."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Nunchaku",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 1,
			"weight": 1,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "B",
			"property": [
				"CCL",
				"ENT",
				"F",
				"TRP"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Light property and the Double Ended property, with the double ended damage being 1d4. You can treat this weapon as if it is Double Ended even while wielding it in one hand. If you dual wield nunchaku, you may make two Double Ended attacks with the same Bonus Action. If you wield only one, you may add your ability modifier to the attack's damage."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Whip",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 2,
			"weight": 1,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "S",
			"property": [
				"DIS",
				"F",
				"R"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases the damage to 1d6, and grants the Entangle, Light, and Trip properties. When you disarm any creature, you choose to place the item anywhere in your reach, or catch it as a reaction. An item in your reach that can be grabbed with the whip can be placed anywhere else in your reach."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"This weapon has an extended reach, being able to hit targets up to 15 ft away. You can use a whip to grasp unattended small objects, or any reasonable handhold within range and if possible, you can pull the object to you."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Chain Sword (Sword)",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 250,
			"weight": 3,
			"dmg1": "1d8",
			"dmg2": "",
			"dmgType": "S",
			"property": [
				"F",
				"V"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery grants the Lunge property. You may change between weapon forms freely, which is how you get the lunge property."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"Versatile damage is 1d10. Can change to the whip form as a bonus action."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Chain Sword (Whip)",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 250,
			"weight": 3,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "S",
			"property": [
				"ENT",
				"R"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"You may change freely between forms. While an enemy is entangled, you can still attack your entangled enemy, or any target within 5ft of it."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"Can change to the sword form as a bonus action."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Light Hammer",
			"type": "R",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 2,
			"weight": 2,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "B",
			"property": [
				"T",
				"L"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"If your attack is at least 5 higher than the target's AC, your enemy's speed is reduced by half until the start of your next turn."
					]
				}
			],
			"range": "20/60",
			"source": "RME"
		},
		{
			"name": "War Hammer",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 15,
			"weight": 3,
			"dmg1": "1d8",
			"dmg2": "",
			"dmgType": "B",
			"property": [
				"V",
				"PEN"
			],
			"entries": [
				{
					"type": "entries",
					"name": "Mastery Perk",
					"entries": [
						"Mastery increases the damage to 1d10/1d12. You ignore resistance to non-magical bludgeoning damage, and when you score a critical hit, your enemy becomes vulnerable to bludgeoning damage for that attack."
					]
				},
				{
					"type": "entries",
					"name": "Weapon Info",
					"entries": [
						"Versatile damage is 1d10."
					]
				}
			],
			"source": "RME"
		}
	]
}
