{
	"_meta": {
		"sources": [
			{
				"json": "Revised-Martial-Equipment",
				"abbreviation": "RME",
				"full": "Revised Martial Equipment v 1.7.0",
				"authors": [
					"Commander Fayne"
				],
				"convertedBy": [
					"Critsarecool"
				],
				"url": "https://github.com/TheGiddyLimit/homebrew",
				"version": "1.7.0",
				"targetSchema": "1.0.0"
			}
		],
		"dateAdded": 1594841115,
		"dateLastModified": 1594841115
	},
	"itemProperty": [
		{
			"abbreviation": "AWK",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Awkward",
					"entries": [
						"This weapon requires additional training to use properly, but you still get limited use with it. You do not add your proficiency bonus while rolling an attack with this weapon. "
					]
				}
			]
		},
		{
			"abbreviation": "CCL",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Conceal",
					"entries": [
						"You gain advantage on Sleight of Hand Checks made to conceal the weapon on your person. If it is discovered, some conceal weapons still require the searching party makes a successful Intelligence check to identify what it is. "
					]
				}
			]
		},
		{
			"abbreviation": "BRC",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Brace",
					"entries": [
						"As an Action you choose to Brace. On your turn, choose any targets you can see that are at least 20 feet away from you. If any one of those targets move within your weapon’s reach before your next turn, you can make one melee attack against it with your weapon, which uses your reaction. If the attack hits, treat the attack as a critical hit. While bracing, you cannot use a reaction. While bracing, if you move or are moved against your will, you forfeit the reaction until your next turn. A brace attack is not an Opportunity Attack. "
					]
				}
			]
		},
		{
			"abbreviation": "DEF",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Deflect",
					"entries": [
						"If struck by a melee weapon attack, you can use your reaction to roll your weapon’s damage plus your strength modifier, then subtract that total from the damage dealt to you for one attack. If you are dual wielding deflect weapons, you may do this to two attacks using the same reaction. "
					]
				}
			]
		},
 		{
			"abbreviation": "DSM",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Disarm",
					"entries": [
						"You may only make a disarm attempt with weapons that have the Disarm property, unless you have an ability that says otherwise. On hit, you can choose to deal only your Strength modifier in damage and force your enemy to roll a Strength or Dexterity Saving Throw. On a failure, it drops one held object of your choice, landing within 5ft of it. If the enemy is larger than you or is using a two-handed weapon, it gains advantage on this save. If it is smaller than you, it suffers disadvantage. Shields that are strapped to the arm are immune to Disarm. "
					]
				}
			]
		},
	        {
			"abbreviation": "DBE",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Double Ended",
					"entries": [
						"You make one additional attack as a bonus action (or part of the attack action, see: Best Practices) using the damage listed, if you are within 5 ft of your target and wielding your weapon with two hands. Double Ended attacks do not benefit from Reach."
					]
				}
			]
		},
 	        {
			"abbreviation": "ETG",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Entangle",
					"entries": [
						"On hit, you can choose to deal only your Strength modifier in damage and force the enemy to succeed on a Strength or Dexterity Saving Throw or be grappled. To escape, the entangled target must succeed a grapple check against your weapon DC, gaining advantage if it is larger than you. Creatures two size categories larger than you are immune to being entangled. While you are holding the weapon entangling your target, your attacks only damage equal to your Strength modifier. You may also interact with your target as if you were grappling it, for example, moving it or shoving it. You can release a foe from being entangled at any time. If you drop the weapon, the foe is automatically freed. "
					]
				}
			]
		},
	        {
			"abbreviation": "FIS",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Finesse",
					"entries": [
						"When making an attack with a finesse weapon, you use your Strength or Dexterity modifier for the attack and damage rolls. You must use the same modifier for both rolls. "
					]
				}
			]
		},
 		{
			"abbreviation": "FIR",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Firearm",
					"entries": [
						"Rolling a 1 on an Attack Roll causes this weapon to jam. It's still loaded, but a malfunction prevented ignition. As an action, you must clear the jam before it can make a ranged attack again. Firearm weapons can't make ranged attacks underwater, and if they are subjected to water such as from rain or a tidal wave spell, they jam on a 1-2 until you spend an action to dry them. All firearms create a sound which can be heard up to 300ft away. Firearm weapons that have the Ranged property require gun powder and either, lead ball, bullet, or shot loaded into it to make an attack. Ammunition is not recoverable from Firearm weapons. Firearm weapons that have the Launch property can be recovered if they fail to go off due to a jam (meaning the weapon was thrown, but did not explode when it landed) "
					]
				}
			]
		},
	        {
			"abbreviation": "HVY",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Heavy",
					"entries": [
						"Category size Small creatures always suffer disadvantage to attack rolls with a heavy weapon. Tiny and smaller cannot wield this weapon. "
					]
				}
			]
		},
	        {
			"abbreviation": "LNC",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Launch",
					"entries": [
						"If you miss, this weapon lands on the ground but still goes off within 5ft of the intended target. Roll a d8. The result is which square it lands in, starting with the square closest to you as 1, and counting clockwise until you reach the rolled number. "
					]
				}
			]
		},
  	        {
			"abbreviation": "LIT",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Light",
					"entries": [
						"This weapon is light and easy to handle. Unless you have the Dual Wielder feat, you can only wield a Light weapon in the off hand. You can make an attack with your off-hand weapon as a Bonus Action or part of the Attack Action. You don't add any ability modifier to damage with this attack unless you have the Two Weapon Fighting Style. "
					]
				}
			]
		},
 		{
			"abbreviation": "LNG",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Lunge",
					"entries": [
						"If you use an attack action, you attack a foe up to 5ft further than normal with all attacks for that turn, which can be combined with Reach. This ends with your turn and cannot be used as part of an Opportunity Attack. Performing a lunge uses your reaction."
					]
				}
			]
		},
	        {
			"abbreviation": "ML",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Melee",
					"entries": [
						"Melee Weapons make a melee weapon attack at another creature up to 5ft away, and add strength modifier to Attack Roll and damage. A Melee weapon cannot be thrown as an attack unless it has the Thrown weapon property. "
					]
				}
			]
		},
	        {
			"abbreviation": "OHD",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "One Handed",
					"entries": [
						"A one-handed weapon requires only one hand to wield, leaving the off-hand open to wield another weapon, shield, grapple, or be used for the somatic component of a spell. "
					]
				}
			]
		},
	        {
			"abbreviation": "PEN",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Penetrate",
					"entries": [
						"These weapons are designed to penetrate armor and deal more damage to those wearing it. While attacking an enemy using a shield or wearing heavy armor, you can roll totale damage from your weapon twice and take the better result. "
					]
				}
			]
		},
 		{
			"abbreviation": "RNG",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Ranged",
					"entries": [
						"Ranged weapons make a ranged weapon attack using dexterity for attack and damage. Your ranged weapon must be loaded with ammunition in order to make an attack. Range always lists two numbers. The first is the weapon's normal range, and the second indicates its maximum range. When attacking enemies beyond the normal range or with an enemy within 5ft of you, you suffer disadvantage for that attack. A ranged weapon cannot attack targets beyond its maximum range."
					]
				}
			]
		},
	        {
			"abbreviation": "RCH",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Reach",
					"entries": [
						"This weapon adds 5 feet to your reach when you make a melee weapon attack, as well as for determining your reach for Opportunity Attacks with it. Note that if there is a creature between you and your enemy within reach, your enemy has half cover. Reach cannot be used to extend the range of a Double Ended attack. "
					]
				}
			]
		},
	        {
			"abbreviation": "RLD",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Reload",
					"entries": [
						"Some ranged weapons take a time to reload, though trained users can reload faster. Reload times are expressed in types of game actions. From fastest to slowest, these are; part of attack, free object interaction, reaction, bonus, attack, action. Requires two hands unless specified. Anything that grants an action such as Haste or Action surge can be used to reload. A Rogue's Fast Hands feature allows them to shorten an Action reload to a Bonus action. Can use any of the slower types of reloads instead of the regular speed of your weapon's reload."
					]
				}
			]
		},
	        {
			"abbreviation": "THR",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Thrown",
					"entries": [
						"Thrown weapons are used to make a ranged attack by throwing them at the enemy, dealing their melee damage at range. They use Strength for attack and damage, unless the weapon has the Finesse property. When attacking enemies beyond the normal range or with an enemy within 5ft of you, you suffer disadvantage for that attack. As part of the attack, after throwing a Thrown weapon, you may draw another weapon. "
					]
				}
			]
		},
 	        {
			"abbreviation": "TRP",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Trip",
					"entries": [
						"If your attack is successful, you can choose to deal only your Strength modifier in damage and your enemy must succeed on a Strength or Dexterity Saving Throw or be knocked prone. Enemies 1 size category larger than you gain advantage on this save. Enemies two size categories larger than you are immune to being tripped in this way. "
					]
				}
			]
		},
	        {
			"abbreviation": "THD",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Two Handed",
					"entries": [
						"This weapon requires two hands to wield, meaning your off hand cannot be used to wield another weapon, shield, or grapple. However, you may still use your off hand for somatic spell components. You can't attack with a two handed weapon if you have only one hand to wield it. "
					]
				}
			]
		},
  	        {
			"abbreviation": "VRS",
			"source": "RME",
			"entries": [
				{
					"type": "entries",
					"name": "Versatile",
					"entries": [
						"This weapon may be used with one or two hands. When used with two hands, the weapon will have a higher damage potential, as well as other benefits from wielding a weapon with two hands. You may switch from two hands to one hand wielding the weapon at any time, and for any reason. "
					]
				}
			]
		}
	],
	"item": [
		{
			"name": "Punch Dagger",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 1,
			"weight": 1,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "P/S",
			"property": [
				"OHD",
				"ML",
				"CCL",
        "FIN",
        "LIT",
        "FIN",
        "PEN"
			],
      "entries": [
				{
					"type": "entries",
					"name": "Master Perk",
					"entries": [
						"You have advantage on opportunity attacks made with this weapon. Additionally, if this weapon is in your off hand, you may make an opportunity attack with your main hand and this weapon."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Whip Dagger",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 15,
			"weight": 3,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"THD",
				"ML",
				"CCL",
        "ETG",
        "FIN",
        "RCH"
			],
      "entries": [
				{
					"type": "entries",
					"name": "Master Perk",
					"entries": [
						"Allows you to wield the weapon with one hand, and gives the Lunge property. When your attack is successful, as a Bonus Action, you can choose to force the enemy to succeed on a Strength saving throw or be pulled up to 10ft toward you."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Gauntlet",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 10,
			"weight": 1,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "B/P/S",
			"property": [
				"OHD",
				"ML",
				"LIT"
			],
      "entries": [
				{
					"type": "entries",
					"name": "Master Perk",
					"entries": [
						"Damage scales with proficiency; d4, d6, d6, and d10 (+2, +3, +5, then +6). As a reaction to a melee attack, before the roll, you can declare that you try to catch the attack. If the attack misses, you have advantage on your next weapon attack, athletics, or acrobatics check against that enemy, or you can give disadvantage to these checks your enemy makes on their next turn, unless they let go of their weapon."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Hidden Blade",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 50,
			"weight": 1,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "P",
			"property": [
				"OHD",
				"ML",
				"CCL",
        "FIN",
        "LIT"
			],
      "entries": [
				{
					"type": "entries",
					"name": "Master Perk",
					"entries": [
						"Any hit against a surprised creature takes maximum damage from this weapon and any modifiers such as sneak attack, instead of rolling for the damage."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Interceptor",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 3,
			"weight": 1,
			"dmg1": "0",
			"dmg2": "",
			"dmgType": "N/A",
			"property": [
				"OHD",
				"CCL",
				"DEF",
        "FIN",
	"LIT"			
			],
      "entries": [
				{
					"type": "entries",
					"name": "Master Perk",
					"entries": [
						"Deflect die is 1d8. Master training gives the additional modifiers Disarm, Entangle, and Trip. You may use the Deflect property against flight weapons. When a creature you can see attacks a target that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Knuckle Axe",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 25,
			"weight": 1,
			"dmg1": "1d6",
			"dmg2": "",
			"dmgType": "S",
			"property": [
				"OHD",
				"MEL",
				"DEF"
			],
      "entries": [
				{
					"type": "entries",
					"name": "Master Perk",
					"entries": [
						"When you score a critical hit, make an additional melee attack to another creature adjacent to you as part of the same action."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Side Baton",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 10,
			"weight": 2,
			"dmg1": "1d6",
			"dmg2": "1d8",
			"dmgType": "B",
			"property": [
				"OHD",
				"MEL",
				"DEF",
        "LIT"
			],
      "entries": [
				{
					"type": "entries",
					"name": "Master Perk",
					"entries": [
						"Master training gives the 1d8 damage die rather than the 1d6, and gives the property Trip. Your deflect roll is 2d10, rather than d8, and you may add your proficiency to this roll."
					]
				}
			],
			"source": "RME"
		},
		{
			"name": "Unarmed Strike",
			"type": "M",
			"weapon": true,
			"weaponCategory": "exotic",
			"rarity": "none",
			"value": 0,
			"weight": 0,
			"dmg1": "1d4",
			"dmg2": "",
			"dmgType": "B",
			"property": [
				"OHD",
				"MEL",
				"FIN"
			],
      "entries": [
				{
					"type": "entries",
					"name": "Master Perk",
					"entries": [
						"Mastery gives the Deflect, Disarm, Light, and Trip properties. Mastery damage scales with proficiency; d4, d6, d6, and d10 (+2, +3, +5, then +6). You may use your bonus action to perform a shove or disarm attack."
					]
				}
			],
			"source": "RME"
		}
    ]
}
